МП/src/Catalogs/ЭлементыДоски/ЭлементыДоски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыДоски</name>
  <owners>Catalog.Разделы</owners>
  <attributes>
    <name>ПапкаДляХраненияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

МП/src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНапоминания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзначальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <resources>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/Catalogs/ЭлементыДоски/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Добавление элемента в раздел",объект.Владелец);	
КонецПроцедуры

&НаКлиенте
Процедура Напоминание(Команда)
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		попытка
			Записать();			
		исключение
			сообщить(ОписаниеОшибки());
			возврат;
		КонецПопытки;
	КонецЕсли;
	ФормаНовогоНапоминания = ПолучитьФорму("РегистрСведений.Напоминания.ФормаЗаписи");
	ФормаНовогоНапоминания.Запись.Элемент = Объект.Ссылка;
	ФормаНовогоНапоминания.Запись.ДатаНапоминания = ТекущаяДата();
	ФормаНовогоНапоминания.Элементы.КнопкиОткладывания.Видимость = ложь;
	ФормаНовогоНапоминания.Открыть();
	закрыть();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если объект.Ссылка.Пустая() Тогда
		элементы.Напоминания.Видимость = ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.Элемент = &Элемент";
	
	Запрос.УстановитьПараметр("Элемент", объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		элементы.ВремяНапоминания.Заголовок = строка(Выборка.ДатаНапоминания);
	иначе
		элементы.Напоминания.Видимость = ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрикрепленныеФайлы.Представление), 0) КАК КоличествоФайлов
		|ИЗ
		|	РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|ГДЕ
		|	ПрикрепленныеФайлы.Элемент = &Элемент";
	
	Запрос.УстановитьПараметр("Элемент", объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() и Выборка.КоличествоФайлов Тогда
		элементы.ПрикрепитьФайл.Заголовок = "Прикрепленные файлы(" + Выборка.КоличествоФайлов + ")";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент Тогда
		Если объект.ссылка.Пустая() Тогда
			этаформа.ТекущийЭлемент = элементы.Наименование;
			НачатьРедактированиеЭлемента();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВремяНапоминанияНажатие(Элемент)
	ФормаСпискаНапоминаний = ПолучитьФорму("РегистрСведений.Напоминания.ФормаСписка");
	ЭлементОтбора = ФормаСпискаНапоминаний.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Элемент");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = объект.Ссылка;
	ФормаСпискаНапоминаний.открыть();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПрикрепитьФайлНажатие(Элемент)
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		попытка
			Записать();			
		исключение
			сообщить(ОписаниеОшибки());
			возврат;
		КонецПопытки;
	КонецЕсли;
	
	Если элементы.ПрикрепитьФайл.Заголовок = "Прикрепить файл" Тогда
		ФормаФайла = ПолучитьФорму("РегистрСведений.ПрикрепленныеФайлы.ФормаЗаписи");
		ФормаФайла.запись.Элемент = объект.Ссылка;
		ФормаФайла.открыть();
		элементы.ПрикрепитьФайл.Заголовок = "Прикрепленные файлы";
	Иначе
		ФормаСпискаФайлов = ПолучитьФорму("РегистрСведений.ПрикрепленныеФайлы.ФормаСписка");
		ЭлементОтбора = ФормаСпискаФайлов.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Элемент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = объект.Ссылка;
		ФормаСпискаФайлов.открыть();
		закрыть();
	КонецЕсли;
КонецПроцедуры
